PAYMENTS = {
    "pay29": {
        "amount": 1,
        "description": "Разовый доступ",
        "message": (
            "Вы приобретаете 1 дополнительный запрос\n\n"
            "После успешной оплаты ваш баланс отобразится в разделе\n"
            "🤖 AI-консультант\n\n"
            "<blockquote>Оплата производится через Yoomoney (ЮKassa) — "
            "сервис безопасных платежей ПАО «Сбербанк»</blockquote>"
        ),
    },
    "pay190": {
        "amount": 190,
        "description": "Пакет из 10 запросов",
        "message": (
            "Вы приобретаете 10 дополнительных запросов\n\n"
            "После успешной оплаты они отобразятся в разделе\n"
            "🤖 AI-консультант\n\n"
            "<blockquote>Оплата производится через Yoomoney (ЮKassa) — "
            "сервис безопасных платежей ПАО «Сбербанк»</blockquote>"
        ),
    },
    "pay950": {
        "amount": 950,
        "description": "Пакет из 50 запросов",
        "message": (
            "Вы приобретаете 50 дополнительных запросов\n\n"
            "После успешной оплаты они отобразятся в разделе\n"
            "🤖 AI-консультант\n\n"
            "<blockquote>Оплата производится через Yoomoney (ЮKassa) — "
            "сервис безопасных платежей ПАО «Сбербанк»</blockquote>"
        ),
    },
    "pay_access": {
        "amount": 2,
        "description": "Полный доступ к сервису",
        "message": (
            "После успешной оплаты доступ будет активирован автоматически\n"
            "+ начислены 50 запросов к "
            "\n«🤖 AI-консультанту»"
            "\n\n<blockquote>Оплата производится через Yoomoney (ЮKassa) — "
            "сервис безопасных платежей ПАО «Сбербанк»</blockquote>"
        ),
    },
}


