import os
import logging
from aiogram import Router, Bot
from aiogram.types import Message
from aiogram.exceptions import TelegramBadRequest
from aiogram.filters import Command
from sqlalchemy.ext.asyncio import AsyncSession

from app.db.crud import closed_menu
from app.redis_client import redis_client


logger = logging.getLogger(__name__)
info_router = Router()


tech_channel_id = int(os.getenv("TECH_CHANNEL_ID"))
guide_post = int(os.getenv("GUIDE_POST"))
rules_post = int(os.getenv("RULES_POST"))
service_post = int(os.getenv("SERVICE_POST"))


@info_router.message(Command("guide"))
async def what_cmd(message: Message, bot:Bot, session: AsyncSession):
    if await closed_menu(message=message, session=session):
        return
    # # 1. Пытаемся отправить мгновенно через Redis (PRO способ)
    # # Мы ищем file_id, который сохранили под именем "intro_video"
    # video_id = await redis_client.get("media:guide_post")
    text = (f"📝 <b>Шпаргалка: «Что нужно учитывать при подборе»</b>"
            f"\n\n<b>1. Основа:</b>"
            f"\n\n• Тип коляски (от рождения или прогулка)"
            f"\n• Функционал (2в1, 3в1 или просто люлька)"
            f"\n• Формат использования (для прогулок или путешествий)"
            f"\n• Сезон (зима или лето)"
            f"\n• Тип дорог (грунт, асфальт или бездорожье)"
            f"\n\n👆 <i>Эти вопросы мы закрыли в самом начале, когда вы проходили квиз-опрос. Это база (фундамент) "
            f"для поиска и подбора подходящей коляски</i>"
            f"\n\n<b>2. Жизненные нюансы (на этом часто «спотыкаются»):</b>"
            f"\n<i>Негативное влияние этих деталей вы также можете почувствовать на себе уже после покупки, если "
            f"не учтете их сейчас</i>"
            f"\n\n• Ширина лифта (возьмите рулетку и замерьте двери. Если коляска окажется шире проема "
            f"всего на 1 см — будете носить её и ребенка на руках)"
            f"\n• Глубина багажника Вашего авто (критически важен тип складывания и компактность)"
            f"\n• Ваш рост (высокие родители часто пинают ногами ось задних колес у компактных колясок, "
            f"для высоких нужна рама с вынесенной назад осью или телескопическая ручка)"
            f"\n• Этажность и наличие лифта (5-й этаж без лифта = мама после кесарева не поднимет коляску весом 16 кг)"
            f"\n• Эргономика (глубина раскрытия капора, угол откидывания спинки, складывание одной рукой, "
            f"комплектация и т.д.)"
            f"\n• Бюджет (не нужно брать кредиты на коляску - всегда есть альтернатива с сопоставимыми характеристиками)"
            f"\n• Дизайн и цвет (внешний вид коляски должен радовать маму 😍)"
            f"\n\n💡 Это всё необходимо держать в голове при подборе идеального варианта"
            f"\n\nВы также можете просто написать свои условия, предпочтения или жизненные обстоятельства "
            f"🤖AI-консультанту и он сам отфильтрует варианты, которые вам подходят по габаритам или цене"
            f"\n\nНапишите ему как есть, например: "
            f"<blockquote>«Живу на 5 этаже без лифта, узкие двери, муж высокий, бюджет 40к»</blockquote>"
            f"\n\n/ai_consultant — <b>Начать умный подбор</b>"
            f"\n\n/quiz_restart — <b>Перепройти квиз (базу)</b>"
            )

    # === ПОПЫТКА 1: REDIS (Теперь безопасная) ===
    video_id = await redis_client.get("media:guide_post")
    if video_id:
        try:
            await message.answer_video(
                video=video_id,
                caption=f"<b>Если видео долго грузится можете просмотреть его тут:</b>"
                        f"\n\nYouTube - https://www.youtube.com/"
                        f"\n\nRUTUBE - https://rutube.ru/"
                        f"\n\nVK Видео - https://vkvideo.ru/"
            )
            await message.answer(text=text)
            print(f"🔔 ПОПЫТКА 1: Redis)")
            return  # Успех, выходим
        except Exception as e:
            logger.error(f"Ошибка отправки video_note из Redis: {e}")

    # 2. FALLBACK 1: Если в Redis пусто, пробуем copy_message (Старый способ)
    # Это страховка на случай, если ты забыл загрузить видео в тех.канал
    try:
        await bot.copy_message(
            chat_id=message.chat.id,
            from_chat_id=tech_channel_id,  # ID тех канала
            message_id=guide_post,  # ID сообщения из группы
            caption=f"<b>Если видео долго грузится можете просмотреть его тут:</b>"
                    f"\n\nYouTube - https://www.youtube.com/"
                    f"\n\nRUTUBE - https://rutube.ru/"
                    f"\n\nVK Видео - https://vkvideo.ru/"
        )
        await message.answer(text=text)
        print(f"🔔 ПОПЫТКА 2: Пересылка из канала)")
        return
    except Exception as e:
        logger.error(f"❌ FALLBACK 1 failed: {e}")

    logger.error("❌ Redis и технический канал недоступны")
    await message.answer(
        text=f"<b>Выберите, где Вам удобнее просмотреть видео:</b>"
             f"\n\nYouTube - https://www.youtube.com/"
             f"\n\nRUTUBE - https://rutube.ru/"
             f"\n\nVK Видео - https://vkvideo.ru/"
             f"\n\n{text}"
    )






@info_router.message(Command("rules"))
async def where_cmd(message: Message, session: AsyncSession):

    if await closed_menu(message=message, session=session):
        return

    await message.answer(f" 1. Карусель видеороликов о правилах правильной эксплуатации"
                         f"\n\n 2. Призыв перейти в раздел '💊 Как продлить жизнь коляске'")




@info_router.message(Command("service"))
async def when_cmd(message: Message, session: AsyncSession):

    if await closed_menu(message=message, session=session):
        return

    await message.answer(f" 1. Карусель видеороликов о ТО детской коляски"
                         f"\n\n 2. Запуск времени до планового ТО")