text_blog = (f"#мысливслух\n"
             f"<blockquote>не рекомендации, но информация к размышлению молодым родителям</blockquote>\n\n"
             f"1. <a href='https://dzen.ru/a/YGV2A-G8U1sQbLkc'>Почему при выборе коляски нельзя доверять отзывам в "
             f"интернете</a>\n\n"
             f"2. <a href='https://telegra.ph/Politika-konfidencialnosti-07-26-9'>Про современные вездеходы с "
             f"маленькими передними колёсами (Джулз)</a>\n\n"
             f"3. Сколько должно быть колясок у ребенка? Две или все-таки одной достаточно?\n\n"
             f"4. Почему покупать коляску из расчета что в случае чего её можно будет починить в корне неверно\n\n"
             f"5. Про гарантийные обязательства продавцов колясок (Магазины могут лишь брать на себя обязательства ради "
             f"лояльности клиента)\n\n"
             f"\n\n#маркетинговыеТефтели\n"
             f"<blockquote>мое мнение о маркетинговых уловках и манипуляциях со стороны производителей "
             f"детских колясок</blockquote>\n\n"
             f"1. <a href='https://dzen.ru/video/watch/606a1fa38f567a4bcfbbe508'>Коляски 3 в 1 - так ли необходима "
             f"автолюлька</a>\n\n"
             f"2. <a href='https://rutube.ru/video/b00a99167eb201cffdc8e79b53b72921/?r=plwd'>Амортизация, системы "
             f"антишок и прочая ерунда</a>\n\n"
             )

text_offer = (f"1. <a href='https://telegra.ph/Oferta-dlya-chat-bota-Babykea-Bot-Babykea-07-14'>Публичная оферта, "
              f"Пользовательское соглашение, условия эксплуатации и обслуживания </a>\n\n"
              f"2. <a href='https://telegra.ph/Politika-konfidencialnosti-07-26-9'>Политика Конфиденциальности</a>")














text_privacy = (f"<a href='https://telegra.ph/Politika-konfidencialnosti-07-26-9'>Этот документ описывает политику "
                f"конфиденциальности для бота @MasterManifest_Bot (Мастер Манифестации📖)</a>\n")






text_hello = (f"<b>Меня зовут Мария — я QA Engineer, создатель этого бота и практик манифестации, исследующая энергию мыслей</b> "
              f"\n\nЯ разработала <b>«Мастера Манифестации📖»</b>, чтобы помогать людям находить ответы, "
              f"вдохновение и внутреннюю опору. Долгое время бот работал полностью за мой счёт:"
              f"\n\n💾 я оплачивала хостинг"
              f"\n🤖 доступ к AI"
              f"\n🔧 дорабатывала функционал"
              f"\n📦 обеспечивала стабильную работу"
              f"\n\nМне это было не обременительно и в радость. Но проект вырос, и его поддержка требует больше ресурсов."
              f"\nЯ рассматривала вариант <i>бесплатного доступа за счёт рекламы</i> (например, за подписку на каналы), "
              f"но отказалась по важным причинам:"
              f"\n\n1. Сейчас очень много мошеннических и деструктивных каналов, с которыми я не хочу связываться"
              f"\n2. У меня нет времени проверять рекламодателей и вести с ними переговоры")

text_hello2 = (f"Поэтому я ввела минимальную оплату за использование бота, чтобы сохранить его качество, независимость "
              f"и честность:"
              f"\n\n1 запрос — <b>30 ₽</b>"
              f"\n20 запросов — <b>550 ₽</b>"
              f"\n100 запросов — <b>2500 ₽</b>"
              f"\n\n<b>🔄 Оплата идёт на поддержку проекта.</b> Всё, что остаётся, — я направляю на "
              f"благотворительность. Получается, что в поисках себя, своего желаемого места в жизни, ты помогаешь не "
              f"только себе, но и еще кому-то в этом мире. Это идеальное распределение созидательной энергии 🙏")


text_info = (f"<a href='https://telegra.ph/CHtoby-otvety-byli-maksimalno-tochnymi-i-poleznymi-vot-neskolko-prostyh-sovetov-07-28'>"
             f"🙏Читайте до конца. Это важно</a>")



string = (f"📖 Что такое @MasterManifest_Bot и как он поможет вам?"
          f"\n\nПредставьте, что у вас есть доступ к мудрому собеседнику, который:"
          f"\n\n✨ Читал тысячи книг, статей и исследований"
          f"\n✨ Понимает, как устроено мышление и как работают ваши убеждения"
          f"\n✨ Может помочь вам изменить мышление, поверить в себя и научиться использовать силу манифестации"
          f"\n\nЭто и есть @MasterManifest_Bot — умный виртуальный помощник, созданный с помощью технологий "
          f"искусственного интеллекта. Он умеет понимать ваши вопросы и давать ответы простым, понятным языком — без осуждения "
          f"и лишней теории\n"
          f"\nНо самое главное — этот бот обучен специально, чтобы помогать людям в таких темах, как:\n"
          f"\n💭 Материализация желаний"
          f"\n🧘‍♀️ Сила мысли и трансформация мышления"
          f"\n💎 Философия богатства"
          f"\n🌌 Закон притяжения"
          f"\n🌱 Работа с подсознанием и внутренними установками\n"
          f"\nПросто напишите свой вопрос — и получите ответ, вдохновение или пошаговый совет, как изменить свою "
          f"реальность через мысли и чувства"
          f"\n\n<i>Нажмите на команду</i> /info <i>что бы узнать как правильно вести диалог с ботом</i>")

